const possibleCcals = {
    body: ['ccal-1200'],
    daily: ['ccal-1600', 'ccal-2000'],
    life: ['ccal-2500'],
};

const ccalTexts = {
    'ccal-1200': `
        Сбалансированный рацион для желающих сбросить вес и скорректировать фигуру. 
        Оптимально подобранные нутриенты для поддержания стройности и жизненной энергии.
        <br><br>
        Включает 5 блюд для 5 приемов пищи в течении дня содержит достаточное 
        количество микроэлементов необходимых в день для организма.
    `,
    'ccal-1600': `
        Рацион для повсендевного питания человека с минимальной физической активностью. 
        Кто поддерживает вес. Балан витаминов и нутриентов который позволяет быть в энергичном состоянии 
        в течении для и не испытвать тяжесть от приема пищи.
        <br><br>
        6 блюд для 5 разнообразных приемов пищи в течении дня содержит достаточне 
        количество микроэлементов необходимых в день для организма.
    `,
    'ccal-2000': `
        Рацион для повсендевного питания человека с минимальной физической активностью. 
        Кто поддерживает вес. Балан витаминов и нутриентов который позволяет быть в энергичном состоянии 
        в течении для и не испытвать тяжесть от приема пищи.
        <br><br>
        6 блюд для 5 разнообразных приемов пищи в течении дня содержит достаточне 
        количество микроэлементов необходимых в день для организма.
    `,
    'ccal-2500': `
        Сбалансированный рацион для питания человека с постоянными активными физическими нагрузками. 
        Для людей с повышенным метаболизмом. Состав нутриентов и витаминов в еде рассчитан 
        с учетом потребностей организма при занятиях спортом. Так же подойдет лицам подросткового возраста 
        в период активного роста для того что бы нормализовать питание.
        <br><br>
        Включает 6 блюд для 5 приемов пищи в течении дня содержит достаточное количество микроэлементов 
        необходимых в день для организма. Позволяет избежать чувства голода в моменты после спортивных нагрузок.
    `
};

const prices = {
    'ccal-1200': {
        'dur-0': 1000,
        'dur-1': 2000,
        'dur-2': 3000,
        'dur-3': 4000,
    },
    'ccal-1600': {
        'dur-0': 5000,
        'dur-1': 6000,
        'dur-2': 7000,
        'dur-3': 8000,
    },
    'ccal-2000': {
        'dur-0': 9000,
        'dur-1': 10000,
        'dur-2': 11000,
        'dur-3': 12000,
    },
    'ccal-2500': {
        'dur-0': 13000,
        'dur-1': 14000,
        'dur-2': 15000,
        'dur-3': 16000,
    },
};