const possibleCcals = {
    body: ['ccal-1200'],
    daily: ['ccal-1600', 'ccal-2000'],
    life: ['ccal-2500'],
};
const correspondingTabs = {
    'ccal-1200': 'body',
    'ccal-1600': 'daily',
    'ccal-2000': 'daily',
    'ccal-2500': 'life'
};
const ccalValues = ['ccal-1200', 'ccal-1600', 'ccal-2000', 'ccal-2500'];

const ccalTexts = {
    'ccal-1200': `
        Сбалансированный рацион для желающих сбросить вес и скорректировать фигуру. 
        Оптимально подобранные нутриенты для поддержания стройности и жизненной энергии.
        <br><br>
        Включает 5 блюд для 5 приемов пищи (белки — 53 г, жиры — 32 г, углеводы — 167 г) 
        в течении дня содержит достаточное количество микроэлементов необходимых в день для организма.
    `,
    'ccal-1600': `
        Рацион для повсендевного питания человека с минимальной физической активностью. 
        Кто поддерживает вес. Балан витаминов и нутриентов который позволяет быть в энергичном состоянии 
        в течении для и не испытвать тяжесть от приема пищи.
        <br><br>
        Включает 6 блюд для 5 разнообразных приемов пищи (белки - 70 г, жиры - 43 г, углеводы - 222 г) 
        в течении дня содержит достаточне количество микроэлементов необходимых в день для организма.
    `,
    'ccal-2000': `
        Рацион для повседневного питания человека с умеренной физической активностью. Расчитанный на людей 
        с нормальным метаболизмом. Подойдет тем кто сочетает малоактивную работу и не интенсивные физические активности. 
        Состав нутриентов в еде рассчитан с учетом потребностей организма.
        <br><br>
        Включает 6 блюд для 5 приемов пищи (белки - 88 г, жиры - 54 г, углеводы - 278 г) в течении дня, 
        содержит достаточное количество микроэлементов, необходимых в день для организма. Позволяет избежать чувства голода.
    `,
    'ccal-2500': `
        Сбалансированный рацион для питания человека с постоянными активными физическими нагрузками. 
        Для людей с повышенным метаболизмом. Состав нутриентов и витаминов в еде рассчитан 
        с учетом потребностей организма при занятиях спортом. Так же подойдет лицам подросткового возраста 
        в период активного роста для того что бы нормализовать питание.
        <br><br>
        Включает 6 блюд для 5 приемов пищи (белки - 110 г, жиры - 67 г, углеводы - 348 г) в течении дня, 
        содержит достаточное количество микроэлементов необходимых в день для организма. 
        Позволяет избежать чувства голода в моменты после спортивных нагрузок.
    `
};

const basePrices = [
    {
        try: 1650,
        base: 5635
    },
    {
        try: 1791,
        base: 6267
    },
    {
        try: 2124,
        base: 7436
    },
    {
        try: 2749,
        base: 9627
    },
];
const prices = {};
basePrices.forEach((dur, i) => {
    prices[ccalValues[i]] = {
        'dur-0': {
            price: dur.try,
            weekly: `${Math.floor(dur.base / 7)} р/день`
        },
        'dur-1': {
            price: dur.base,
            weekly: `${dur.base} р/нед`
        },
        'dur-2': {
            weekly: `${Math.floor(0.95 * dur.base)} р/нед`,
            price: 2 * Math.floor(0.95 * dur.base),
            profit: 2 * (dur.base - Math.floor(0.95 * dur.base)),
        },
        'dur-3': {
            weekly: `${Math.floor(0.93 * dur.base)} р/нед`,
            price: 3 * Math.floor(0.93 * dur.base),
            profit: 3 * (dur.base - Math.floor(0.93 * dur.base)),
        }
    }
});